{
  "title": "Featured Projects",
  "description": "Here are some of the key experiences and responsibilities from my professional career.",
  "projects": [
    {
      "title": "Automatic Architecture Documentation",
      "description": "Involved in requirements gathering, analysis, design architecture as code. Integration with different systems such as Jira, Confluence through Restful API. Developing library to generate model code using Java Core and unit testing according to TDD. Monitor importer, exporter, publisher jobs using TeamCity. Working on agile scrum methodology and using kanban to monitor workflow. Participate peer code reviews, providing comments and suggestions. Mentor and support new members.",
      "image": "https://www.netsolutions.com/wp-content/uploads/2024/12/What-is-Software-Architecture-in-Software-Engineering_.webp",
      "technologies": ["Java Core", "RESTful API", "TDD", "TeamCity", "Agile Scrum", "Kanban"],
      "liveDemo": "",
      "sourceCode": "",
      "challenges": "Integrating with different systems and developing a model code generation library."
    },
    {
      "title": "Mall Loyalty Application",
      "description": "Involved in requirements gathering, analysis, design, and documentation of the application. Implementing the backend business layers using Restful web services, Redis cache and Azure queue systems. Developing microservices using Java Spring Boot, Hibernate with good quality of code. Developing and unit testing assigned software features and functionalities using Postman. Working on agile scrum methodology and involving in stand-up meetings to monitor the progress. Presented and added the value to the team through participation in peer code reviews, providing comments and suggestions. Integrated collaboratively with cross-functional teams to achieve goals.",
      "image": "https://www.taosabao.com/wp-content/uploads/2022/03/10-reasons-shopping-mall-loyal-program-works.jpg",
      "technologies": ["Java Spring Boot", "Hibernate", "RESTful Web Services", "Redis Cache", "Azure Queue Systems", "Postman", "Agile Scrum"],
      "liveDemo": "",
      "sourceCode": "",
      "challenges": "Implementing backend business layers with Redis cache and Azure queue systems, and developing microservices with high code quality."
    }
  ]
}